In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

In [1]:
# Importando o pandas
import pandas as pd

In [2]:
# Importando os dados do arquivo excel
df = pd.read_excel("Dados.xlsx")

In [13]:
# Usando o loc
# df.loc[4:6] - Linhas
# df.loc[[1, 3, 4]]
df.loc[4:6, "NameStyle":"LastName"]

   NameStyle Title FirstName MiddleName  LastName
4          0   Ms.      Gail          A  Erickson
5          0   Mr.    Jossef          H  Goldberg
6          0   NaN     Dylan          A    Miller

In [22]:
# Usando o iloc
df.iloc[[2, 6], [True, True]]

   BusinessEntityID PersonType
2                 3         EM
6                 7         EM

In [3]:
df.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0